package markdown

import (
	"context"
	"testing"
)

var content = `
<p style=""><img src='https://cdn.sanjieke.cn/upload/image/210402/606673fb01678.png' width="150"></p><p style="">
</p><p style="">今天想给你分享一些我接触营销到现在，8年间观察到的营销学科对营销人文案要求的变化：</p><p style="">
</p><p style=""><b>8年来什么都在变，但消费者、市场、企业对好内容的需求从未改变。</b></p><p style="">
</p><p style="">这个结论，回顾我这8年来的观察与经历，似乎有迹可循。</p><p style="">
<video src="images/1.mp4" controls> </video>
</p><h3 style=""><b>无心的白莲花之举，幸运踩中百度的核心机制：</b><b>用户至上，内容为王</b></h3><p style="">2011年，还是学生的我因为勤工俭学首次接触到了百度发帖的概念，那时候还不知道在百度贴吧发帖，在百度知道提出问题、回答问题是内容营销的手段之一。只知道，自己因为擅长回答问题，擅长研究百度知道的审核机制和评优规律，凭借着80%的好评采纳率和10%的招生报名率成为了众多兼职的小组长。</p><p style="">
</p><p style="">坦白说，那时候并不知道百度的机制是用户为皇，一切机制围绕用户展开。只是在看过很多竞品提出的问题和回答后，着实觉得太劣质。完全没有为提问者解答问题，只是机械的把广告语黏贴到回答框提交就算完事。更甚者连广告语都省了，直接用各种钻空子的小聪明，将自家公司的联系方式变形后提交上去。类似这样的：</p><blockquote style=""><p style="">咨询dian话：零10，③五柒八，rr⑥qi（是数字）</p></blockquote><p style="">
</p><p style="">我：……        <img src='https://cdn.sanjieke.cn/homework/fetch/img/2024-05-14/2300541i0u9htyglp8x.png' width="68" alt="">      </p><p style="">
</p><p style="">当即便下定决心，定不干这糟心事，一定要秉持为提问者解决问题的原则回答问题。当我践行这一理念后，意料之外却又是情理之中的事情发生了：<b>2个月的时间，我的百度账号飙升到8级。</b>带来的直接好处就是，百度知道审核规则日趋严格，我的账号却依然能做到秒过，同时80%的<b>回答都会在5分钟内成为提问者采纳+百度推荐的双优回答</b>。</p><p style="">
</p><p style="">这其中的“用户至少，优质内容为王”的奥妙，我却是在三年后，才清晰的知道。</p><p style="">
</p><p style=""><b>SEO大牛：</b><b>外链为后，内容为王</b></p><p style="">2013年，百团大战正精彩。</p><p style="">外卖O2O在13年~15年最为火爆，其中出现了很多外卖拼团，包括百度外卖、美团外卖、饿了么、超人外卖等等，一起登上百团大战的舞台，硝烟愈浓。</p><p style="">
</p><p style="">那时候我的我在干什么呢？拿着实习offer，战战兢兢的享受着公司的福利：价值2000元的SEO培训。</p><p style="">
</p><p style="">百度竞价虽然在趋势上力压SEO，但SEO人才依然紧俏，只要你说自己会点SEO，在北京工资6000非常容易。（要知道那时候我们同学之间有人工资3500就已经非常了不得了），可惜当时自己太年轻，不知道孰轻孰重，除了记得老师反复强调：内容为王，内容为王。其他啥也没记住。</p><p style="">
</p><p style="">不巧，很幸运的是，<b>3个月后我负责优化的网站，排名稳定保持在百度首页。</b>原因无外乎，我再一次践行了百度发帖时期的原则：用户至上，内容为王。</p><p style="">
</p><p style="">诚然，当时有很多践行黑帽优化手法的公司，靠着关键词堆砌和外链站群，完全不顾网站内容是否是用户需要的结果，也可以实现更快速的首页排名结果。但，<b>无法回避的是，他们没有遵循做营销的原则：</b><b>用户至上，有效优质内容为王。</b></p><p style="">
</p><p style="">所以在2013年2月19日，<b>百度发布绿萝算法的那天，这批网站悄无声息的从百度数据库中失去了踪迹。</b>依然屹立在百度首页的是那些坚持践行用户至上，用心做好内容的网站。</p><p style="">
</p><p style="">一切营销规则，都是围绕用户需求设计。</p><p style="">
</p><h3 style=""><b>SEM团战时代：</b><b>内容为王体现在落地页的转化率上</b></h3><p style="">2008~2014年，百度竞价为百度赚的盆满钵满，随着Google推出中国内地市场，百度更是一人独霸天下。</p><p style="">
</p><p style="">趁着百度竞价的红利，圈定一批优质的精准，赚得合不上钱包的企业不在少数。</p><p style="">
</p><p style="">虽然有获利者，但依然挡不住坊间“趣闻”的发生：“百度哪有什么竞价优化规则，还不是有钱就行。”</p><p style="">
</p><p style="">坦白说，百度竞价规则确实可以简单粗暴的理解为有钱就行。但是如果认为在做百度竞价这件事上，真的是有钱就能买来流量和企业效益的增长，那未免有些孩童的可爱和天真之嫌。</p><p style="">
</p><p style=""><b>营销人的核心目标从来不是为企业带来价值无法判断的流量，而是通过一系列活动传递企业产品价值，为公司带来实际的业绩增长</b><b>。</b>这体现在工作的考核指标上，往往是：转化率。包括但不限于：电话呼入数，留电数，激活数，直接下单数等。</p><p style="">
</p><p style="">所以，仅仅将做营销，做竞价优化这件事的高度放在不惜一切代价获取流量上的企业，往往也忽略了网站内容的建设。花大价钱从百度买来了流量，网站上却没有符合用户需求的内容做承接，转化率可想而知。最后的结果往往：承受不住转化少，成本高的压力，推出了竞争舞台。</p><p style="">
</p><p style=""><b>而留在舞台上的企业，不仅仅是因为有钱，更多是因为他们明白，并且在践行“用户至上，内容为王”的道理。</b></p><p style="">
</p><h3 style=""><b>信息流井喷，AI智能文案时代</b></h3><p style="">2016年~2018年，是信息流广告高速发展阶段。百度、阿里、头条相继发布AI智能文案工具。如往年一样，有新事物出现，那句话就会响起：“XX已死”，这次被死亡的是——文案。</p><p style="">
</p><p style="">如果你做过广告投放，特别是信息流广告投放，一定对这些文案工具不陌生。如果没有体验过也可以百度一下“百度好文案工具”、“阿里智能文案”，体验一下这工具的便捷，和让人心甘情愿偷懒的危险之处。</p><p style="">
</p><p style="">是的，危险。</p><p style="">
</p><p style="">智能文案工具的出现，让众多广告优化从业者，特别是工作任务繁重的乙方公司从业者拍案叫绝，高声叫好。</p><p style="">
</p><p style="">他们认为，有了AI智能文案工具，自己不仅再也不用写文案，还能轻松便捷的看到隔壁竞品的优秀文案长什么样，一键复制简直不要太好用！</p><p style="">
</p><p style="">如此这般做了一段时间的优化后惊觉，广告账户的效果似乎不如从前，文案素材的评分似乎也有下降的趋势。善于观察和反思者发现：<b>走在效果前沿的竞品是每次创新文案的那几家，效果不好的大多是用文案工具抄袭、伪原创优质文案的那些。</b>于是他们醒悟，开始从屈服于工具转变成掌控工具，利用工具看竞品文案找灵感，帮助自己写出有差异化的好的原创文案。</p><p style="">
</p><p style="">反应稍迟钝的“实干派”，依然沉浸在账户的细节上来回调整，却始终没发现文案工具哪里有问题。殊不知，终有一天将无法逃脱被下岗的结局。</p><p style="">
</p><p style="">2018~2019年抖音、小红书、微博vlog携手登上新的战场，你去看，能走红的，还是拥有用户视角（用户至上）、手握优质内容的那波人。</p><p style="">
</p><h3 style=""><b>后记</b></h3><p style="">不知不觉已经说了2千多字。将这8年间的所见所闻分享出来，只是想说，我看到太多营销人忽略了修炼好文案功底的重要性，也看到太多人，因为有好的文案功底而大受脾益。例如三节课联合创始人、畅销书《运营之光》作者黄有璨黄老师，再比如，半年成为创业圈红人的刀姐Doris。</p><p style="">
</p><p style=""><b>如果营销人只能选一个能力精进，那一定是有用户视角的文案能力。</b></p><p style="">
</p><p style="">过去不追忆，未来定可期，愿你有所收获。</p>
`

func TestDownLoad_SpecialHtml(t *testing.T) {
	ctx := context.Background()
	_, err := Download(ctx, content, "失效的输入检测（上）：攻击者有哪些绕过方案？", "./geektime-downloader", true)
	if err != nil {
		t.Error(err)
	}
}
